import os

# =========================================================
# SERVER
# =========================================================

bind = f"0.0.0.0:{os.getenv('PORT', '10000')}"

# فقط یک Worker
# چون Media Group در حافظه برنامه نگهداری می‌شود
workers = 1

# تعداد Threadها
threads = 2

# حداکثر زمان پردازش درخواست
timeout = 300

# Keep-Alive
keepalive = 5


# =========================================================
# WORKER
# =========================================================

worker_class = "gthread"

# جلوگیری از اجرای چندباره initialization
preload_app = False


# =========================================================
# LOGGING
# =========================================================

accesslog = "-"
errorlog = "-"
loglevel = "info"
